a = input()
b = input()
if (a == 'красный' or a == 'желтый' or a == 'синий') and b == a:
    print(a)
elif (a != 'красный' and a != 'желтый' and a != 'синий') or (b != 'красный' and b != 'желтый' and b != 'синий'):
    print('ошибка цвета')
elif (a == 'красный' and b == 'желтый') or (a == 'желтый' and b == 'красный'):
    print('оранжевый')
elif (a == 'красный' and b == 'синий') or (a == 'синий' and b == 'красный'):
    print('фиолетовый')
elif (a == 'синий' and b == 'желтый') or (a == 'желтый' and b == 'синий'):
    print('зеленый')
